Sprue-Software/Gateway_Windows/MIMXRT1051xxxxB_Project/source/MIMXRT1051xxxxB_Project.c
extern int https_update_ota(char* host, char* port, char* resource);  //////// [nchatzi] I'd be nicer if the OTA functions were abstracted into the HAL/OSAL API...
void initLoggingProcess(void);



/*******************************************************************************
 * Code
 ******************************************************************************/

bool getSystemRunStatus(void)
{
    return _bSystemReadyToRun;
}

bool gatewayTypeWG2C(void)
{
    return wg2c;
}

void InitStatsTimer (void)
{
    gpt_config_t gptConfig;

    /*Clock setting for GPT*/
    CLOCK_SetMux(kCLOCK_PerclkMux, 0);
    CLOCK_SetDiv(kCLOCK_PerclkDiv, 0);

    GPT_GetDefaultConfig(&gptConfig);

    /* Initialize GPT module */
    GPT_Init(GPT1, &gptConfig);

    GPT_SetClockDivider(GPT1, 1500);

    GPT_StartTimer(GPT1);
}

uint32_t StatsTimerValue(void)
{
	return GPT_GetCurrentTimerCount(GPT1);
}

void vApplicationStackOverflowHook(xTaskHandle *pxTask, signed char *pcTaskName )
{
	LOG_Error("Task [%s] has a corrupt stack",pcTaskName);
	for( ;; );
}

/**
 * \brief Dumps Initial Certificates to KeyStore. Used for test purposes.
 *
 * \param none
 * \return none
 */
static void dump_initial_certificates_if_not_exist(void)
{
    uint8_t *flashData;
    int32_t retVal;
    void* keys = KEY_Open();

    if (keys == NULL)
    {
        LOG_Error("Failed to open keystore!");
        return;
    }

    if (KEY_Get(keys, ensoAgentSettings.rootCA) == NULL)
    {
        LOG_Warning("RootCA not found in FS, checking flash serialisation");
        flashData = HAL_GetRootCA();
#if USE_SERIALISATION_IN_FLASH
        if (flashData[0] != 0xFF)
        {
            LOG_Warning("RootCA found in flash serialisation, saving new...");
            retVal = KEY_Add(keys, ensoAgentSettings.rootCA, flashData);
           // dumpHex(flashData,sizeof(flashData));
        }
        else
#endif
        {
            LOG_Warning("RootCA not found in flash, saving hard-coded value");
            retVal = KEY_Add(keys, ensoAgentSettings.rootCA, _RootValue);
        }

        if (retVal != 0)
        {
            LOG_Error("Failed to write RootCA!");
            return;
        }
    }
    else
    {
        LOG_Info("Loaded existing RootCA from FS");
    }

    if (KEY_Get(keys, ensoAgentSettings.certificate) == NULL)
    {
        LOG_Warning("Certificate not found in FS, checking flash serialisation");
        flashData = HAL_GetCertificate();
#if USE_SERIALISATION_IN_FLASH
        if (flashData[0] != 0xFF)
        {
            LOG_Warning("Certificate found in flash serialisation, saving new...");
            retVal = KEY_Add(keys, ensoAgentSettings.certificate, flashData);
        }
        else
#endif
        {
            LOG_Warning("Certificate not found in flash, saving hard-coded value");
            retVal = KEY_Add(keys, ensoAgentSettings.certificate, _CertValue);
        }

        if (retVal != 0)
        {
            LOG_Error("Failed to write Certificate!");
            return;
        }
    }
    else
    {
        LOG_Info("Loaded existing Certificate from FS");
    }

    if (KEY_Get(keys, ensoAgentSettings.privateKey) == NULL)
    {
        LOG_Warning("Private key not found in FS, checking flash serialisation");
        flashData = HAL_GetKey();
#if USE_SERIALISATION_IN_FLASH
        if (flashData[0] != 0xFF)
        {
            LOG_Warning("Private key found in flash serialisation, saving new...");
            retVal = KEY_Add(keys, ensoAgentSettings.privateKey, flashData);
        }
        else
#endif
        {
            LOG_Warning("Private key not found in flash, saving hard-coded value");
            retVal = KEY_Add(keys, ensoAgentSettings.privateKey, _PKeyValue);
        }

        if (retVal != 0)
        {
            LOG_Error("Failed to write Key!");
            return;
        }
    }
    else
    {
        LOG_Info("Loaded existing Key from FS");
    }

    LOG_Info("Initial certificates are saved!");
}



static void BOARD_InitModuleClock(void)
{
    const clock_enet_pll_config_t config =
    {
       true,
       false,
       false,
       1,
       1
    };
   CLOCK_InitEnetPll(&config);
}



static void delay(int n)
{
    volatile uint32_t i = 0;
    for (i = 0; i < n; ++i)
    {
        __asm("NOP"); /* delay */
    }
}

static void setup_board()
{
    // Initialise board
    gpio_pin_config_t gpio_config = {kGPIO_DigitalOutput, 0, kGPIO_NoIntmode};
    BOARD_ConfigMPU();
    BOARD_InitPins();
    BOARD_BootClockRUN();
    BOARD_InitDebugConsole();
    BOARD_InitModuleClock();

#if LOW_POWER_MODE
    if (true != LPM_Init(LPM_PowerModeSysIdle))
    {
        LOG_Error("LPM Init Failed!");
    }

    LPM_DisablePLLs(LPM_PowerModeSysIdle);

    SystemCoreClockUpdate();
#endif

    // Data cache must be temporarily disabled to be able to use sdram
    // N.B. Do this later? (after ifup, before DHCP)
    SCB_DisableDCache();
    // SCB_DisableICache();

    // Setup RAM regions
    const HeapRegion_t xHeapRegions[] =
    {
        { ( uint8_t * ) 0x20000000UL, 0x20000 },    // DTC
        { ( uint8_t * ) 0x20200000UL, 0x40000 },    // OC
        { ( uint8_t * ) 0x80200000UL, 0xC00000 },   // SDRAM (CADB)
        { NULL, 0 }
    };
    vPortDefineHeapRegions( xHeapRegions );

    // Setup HW
    // Enable Ethernet
    GPIO_PinInit(GPIO1, 14, &gpio_config_output);
    enable_wired_ethernet(true);
    CRYPTO_InitHardware();
}

/*!
* @brief The main function containing client thread.
*/
static void setup_lan_and_time(void *arg)
{
const uint8_t mac[NETIF_MAX_HWADDR_LEN];

uint8_t serial[SERIAL_SIZE];
char string[STRING_SIZE];
Serial_str= (char *) malloc(STRING_SERIAL);
mac_str= (char*)malloc(STRING_MAC);
HAL_GetMACAddressBytes(mac);

LOG_Info("Reading MAC address... [%02x %02x %02x %02x %02x %02x]",mac[0],mac[1],mac[2],mac[3],mac[4],mac[5]);


LOG_Info("Setting up LAN...");
HAL_serialBytes(serial);
if (Serial_str!=NULL)
{
    snprintf(Serial_str,STRING_SERIAL,"0x%02x 0x%02x 0x%02x 0x%02x 0x%02x 0x%02x 0x%02x 0x%02x 0x%02x 0x%02x 0x%02x 0x%02x 0x%02x 0x%02x 0x%02x 0x%02x 0x%02x 0x%02x 0x%02x 0x%02x 0x%02x 0x%02x 0x%02x 0x%02x",
    serial[0],serial[1],serial[2],serial[3],serial[4],serial[5],serial[6],serial[7],
    serial[8],serial[9],serial[10],serial[11],serial[12],serial[13],serial[14],serial[15],
    serial[16],serial[17],serial[18],serial[19],serial[20],serial[21],serial[22],serial[23]);
}
  if (mac_str!=NULL)
{
    snprintf(mac_str,STRING_MAC,"%02x %02x %02x %02x %02x %02x",mac[0],mac[1],mac[2],mac[3],mac[4],mac[5]);
}
ip4_addr_t fsl_netif0_ipaddr, fsl_netif0_netmask, fsl_netif0_gw;
ip4_addr_t fsl_netif1_ipaddr, fsl_netif1_netmask, fsl_netif1_gw;
#if 0
ethernetif_config_t fsl_enet_config0 = {
    .phyAddress = EXAMPLE_PHY_ADDRESS,
    .clockName = EXAMPLE_CLOCK_NAME
};

memcpy(fsl_enet_config0.macAddress, &mac, NETIF_MAX_HWADDR_LEN);
#endif
LWIP_UNUSED_ARG(arg);

IP4_ADDR(&fsl_netif0_ipaddr, 0, 0, 0, 0);
IP4_ADDR(&fsl_netif0_netmask, 0, 0, 0, 0);
IP4_ADDR(&fsl_netif0_gw, 0, 0, 0, 0);

IP4_ADDR(&fsl_netif1_ipaddr, 0, 0, 0, 0);
IP4_ADDR(&fsl_netif1_netmask, 0, 0, 0, 0);
IP4_ADDR(&fsl_netif1_gw, 0, 0, 0, 0);


//tcpip_init(NULL, NULL);
 //nishi
//netif_add(&fsl_netif0, &fsl_netif0_ipaddr, &fsl_netif0_netmask, &fsl_netif0_gw,&fsl_enet_config0, ethernetif0_init, tcpip_input);
//PHY_RegisterLinkStatusCallback(link_status_callback, (void *)&fsl_netif0);
//netif_set_up(&fsl_netif0);
//netif_set_default(&fsl_netif0);
 //nishi
//netif_add(&fsl_netif1, &fsl_netif1_ipaddr, &fsl_netif1_netmask, &fsl_netif1_gw, NULL, vnic_init, tcpip_input);
//vnic_RegisterLinkStatusCallback(usb_link_status_callback, (void *)&fsl_netif1);
//netif_set_up(&fsl_netif1);

LOG_Info("Getting IP address from DHCP...");
/********/SCB_DisableDCache();
#if 0
if (ERR_OK != dhcp_start(&fsl_netif0))
{
    LOG_Error("dhcp_start(&fsl_netif0) failde");
}
dhcp_start(&fsl_netif1);

struct dhcp *dhcp0,*dhcp1;
dhcp0 = (struct dhcp *)netif_get_client_data(&fsl_netif0, LWIP_NETIF_CLIENT_DATA_INDEX_DHCP);
dhcp1 = (struct dhcp *)netif_get_client_data(&fsl_netif1, LWIP_NETIF_CLIENT_DATA_INDEX_DHCP);

while ((dhcp0->state != DHCP_STATE_BOUND) && (dhcp1->state != DHCP_STATE_BOUND))
{
    vTaskDelay(1000);
}

if (dhcp0->state == DHCP_STATE_BOUND)
{
    LOG_Info("Ethernet DHCP data");
  //nishi  dump_net_config(&fsl_netif0);

