Sprue-Software/Gateway_Windows/MIMXRT1051xxxxB_Project/source/MIMXRT1051xxxxB_Project.c
}


if (dhcp1->state == DHCP_STATE_BOUND)
{
    LOG_Info("USB DHCP data");
   //nishi dump_net_config(&fsl_netif1);
}
#endif
LOG_Info("DHCP OK");
//Gateway_Status_request.Serial_Number=HAL_GetSerialNumberString();
#if 0
if(xTaskCreate(EndofLineTest, ((const char*)"EndofLineTest"), ENSO_AGENT_STACK_SIZE, NULL, tskIDLE_PRIORITY + 3 + PRIORITIE_OFFSET, NULL) != pdPASS)
{
    LOG_Info("Task creation failed!.");
}
#endif
// LAN Connected so get time from cloud
//nishi setup_system_time();

// Perform OTA update test
#if OTA_OVER_HTTPS_TEST
if (https_update_ota(ensoAgentSettings.otaURL,
                     ensoAgentSettings.otaPort,
                     ensoAgentSettings.otaResourceName) == 0)
{
    HAL_Reboot();
}
else
{
    LOG_Error("\r\nOTA Failed!");
}
#endif

#if configGENERATE_RUN_TIME_STATS
static char stats_buf[1024];
vTaskGetRunTimeStats(stats_buf);
LOG_Error("Schedule Stats\n%s\n",stats_buf);
#endif

// Send a signal to EnsoAgent Thread to start EnsoAgent application
_bSystemReadyToRun = true;

// Kill init thread after all init tasks done
vTaskDelete(NULL);
}

/*
 * \param  params Not used
 *
 * \return nonde
 */
void EnsoAgentLED(void* params)
{
    extern int EnsoMain(int argc, char* argv[]);

    // We need to wait until system (LAN, Time etc) up and run
    while (_bSystemReadyToRun == false)
    {
        OSAL_sleep_ms(100);
    }

#if FORMAT_DEVICE
    LOG_Info("EFS contents (before format):");
    EFS_List();
    LOG_Info("Formatting EFS Device Storage!");
    EFS_FormatDevice();
    LOG_Info("Formatting STO Device Storage!");
    STO_FormatDevice();
#endif

    // If there does not exist crypto keys, dump initial keys
    dump_initial_certificates_if_not_exist();

    LOG_Info("EFS contents:");
    EFS_List();

    // Prepare parameters for EnsoAgent main
    char* argv[4];
    argv[0] = ensoAgentSettings.name;
    argv[1] = ensoAgentSettings.rootCA;
    argv[2] = ensoAgentSettings.certificate;
    argv[3] = ensoAgentSettings.privateKey;

    // Call the EnsoAgent Application
    int retVal = EnsoMain(sizeof(argv) / sizeof(argv[0]), argv);

    if (0 != retVal)
    {
        LOG_Error("\n\n");
        LOG_Error("EnsoMain failed to initialise, rebooting...\n\n");
        OSAL_sleep_ms(1000);
        HAL_Reboot();
    }

    // Kill the Enso Agent Thread
    vTaskDelete(NULL);
}
/* TODO: insert other definitions and declarations here. */

/*
 * @brief   Application entry point.
 */
int main(void) {
  	/* Init board hardware. */
    //BOARD_InitBootPins();
    //BOARD_InitBootClocks();
    //BOARD_InitBootPeripherals();
//struct stat test;
//test.st_dev=0;
  //  printf("Hello World\n");

    //////// [RE:fixme] May want to start wdog here/ASAP rather than later

       // Setup HW
       setup_board();

       initLoggingProcess();

       LED_Manager_Init();


       LOG_Info("\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n");
       LOG_Info("Starting");
       // check pin status, 0 = WG-2C, 1 = WG-2R
       if (GPIO_PinRead(GPIO3, 14))
       {
           LOG_Info("Platform detected as WG-2R");
           Gateway_Status_request.Board_Type="WG-2R";
       }
       else
       {
           LOG_Info("Platform detected as WG-2C");
           wg2c = true;
           Gateway_Status_request.Board_Type="WG-2C";
       }
       LOG_Info("Software version: %d.%d.%d", SOFTWARE_MAJOR_VERSION, SOFTWARE_MINOR_VERSION, SOFTWARE_REVISION);
       LOG_Info("Build date %s %s", __DATE__, __TIME__);
       LOG_Info("Clock speed = %dMHz", CLOCK_GetFreq(kCLOCK_CpuClk)/1000000);

       // Init flash driver
       SPI_Flash_Init();

       EFS_Init(); //////// [RE:nb]  Need to init EFS driver

       STO_Driver_Init(); //////// [RE:nb]  Need to init STO driver


       if (wg2c)
       {
           if (initPowerMonitor() == 0)
           {
   #if BATTERY_FITTED
               if (initBatteryManager() != 0)
               {
                   LOG_Error("Failed to initialise battery manager task");
               }
                   Gateway_Status_request.Battery_connected=1;
   #endif
           }
           else
           {
               LOG_Error("Failed to initialise power monitoring task");
           }
       }

       // Run RTOS task
       if(xTaskCreate(setup_lan_and_time, ((const char*)"setup_lan_and_time"), ENSO_AGENT_STACK_SIZE, NULL, tskIDLE_PRIORITY + 3 + PRIORITIE_OFFSET, NULL) != pdPASS)
       {
           LOG_Info("Task creation failed!.");
       }

       // Create a thread for EnsoAgent Application
       if(xTaskCreate(EnsoAgentLED, ((const char*)"EnsoAgentLED"), ENSO_AGENT_STACK_SIZE, NULL, tskIDLE_PRIORITY + 0, NULL) != pdPASS)
       {
           LOG_Info("Task creation failed!.");
       }

    /* Force the counter to be placed into memory. */
    volatile static int i = 0 ;
    /* Enter an infinite loop, just incrementing a counter. */
    while(1) {
        i++ ;
        /* 'Dummy' NOP to allow source level single stepping of
            tight while() loop */
        __asm volatile ("nop");
    }
    return 0 ;
}


#define LOG_OUTPUT_QUEUE_LENGTH      1000
#define LOG_OUTPUT_QUEUE_ITEM_SIZE   sizeof(char *)

QueueHandle_t debugQueue = NULL;

int maxQueuedMsgCount = 0;
void LogOutputTask(void *params)
{
    uint8_t *debugMessage;
    int msgQueueCount;
    int msgCount = 0;

    for (;;)
    {
        msgQueueCount = uxQueueMessagesWaiting(debugQueue);
        if (msgQueueCount > maxQueuedMsgCount)
        {
            maxQueuedMsgCount = msgQueueCount;
        }

        if( xQueueReceive( debugQueue, &debugMessage, portMAX_DELAY ) == pdPASS )
        {
            OSAL_printf("%s\r",debugMessage);
            vPortFree(debugMessage);
            msgCount++;
            if (msgCount >=100)
            {
                msgCount = 0;
                //OSAL_printf("\r\n=================>>>>>>>>>>>>>>>>>>>  Current pending msg = %d, Max = %d\r\n\r\n",msgQueueCount,maxQueuedMsgCount);
            }
        }
    }
}


/*
 * \brief  Create logging task and resources
 *
 * \param  None
 *
 * \return None
 */
void initLoggingProcess(void)
{
    OSAL_printf("initLoggingProcess!\r\n");

    // Queue for debug messages to be output
    debugQueue = xQueueCreate( LOG_OUTPUT_QUEUE_LENGTH, LOG_OUTPUT_QUEUE_ITEM_SIZE );
    if(debugQueue == NULL)
    {
        OSAL_printf("Log output message queue creation failed!\r\n");
        while(1);
    }

    // Create a thread for Debug output
    if(xTaskCreate(LogOutputTask, ((const char*)"Log output"), ENSO_AGENT_STACK_SIZE, NULL, tskIDLE_PRIORITY + 1, NULL) != pdPASS)
    {
        OSAL_printf("Log output task creation failed!\r\n");
    }
}


